/*2020. 02. 04
 *  codenote@naver.com
 *  [20200204] 이름 - 1,2장 정리
 * <CH.1>
 * 1. 자바란?
 * -객체지향 프로그래밍 언어
 * 2. 자바 언어의 특징?
 * -운영체제에 독립적
 * -객체지향언어
 * -자동 메모리 관리
 * -네트워크 분산처리 지원
 * -멀티쓰레드를 지원
 * -동적 로딩 지원
 * 3. JVM이란?
 * -자바 가상 머신(Java viryal Machine)
 * 	3.1 JDK
 * -자바 개발 도구(Java Development Kit)
 *		3.1.1 javac.exe -자바 컴파일러
 *		3.1.2 java.exe 	-자바 인터프리터
 * 	3.2 JRE
 * -자바 실행 환경(Java Runtime Environment)
 * 4. JAVA API
 * -자바에서 제공하는 클래스 라이브러리
 * 5. 자바 프로그램 실행 과정
 * -소스코드 작성>컴파일>클래스 생성>실행
 * 6. 자바 주석의 종류
 * 범위주석과 한줄주석
 * <CH.2>
 * 1. 변수란?
 * 단 하나의 값을 저장할 수 있는 메모리 공간
 * 2. 변수의 선언
 * 변수타입 변수이름;
 * 3. 변수의 초기화
 * 변수이름 = 값;
 * 4. 변수의 선언 및 초기화
 * 변수타입 변수이름 = 값;
 * 5. 기본 자료형의 종류
 * 기본형(논리형, 문자형, 정수형, 실수형) 참조형
 * 6. 식별자 명명 규칙
 * -대소문자가 구분되고 길이에 제한없음
 * -예약어 사용 금지
 * -숫자로 시작 불가
 * -특수문자는 _, $만 허용
 * 7. 상수란?
 * 한번 값을 저장하면 다른 값으로 변경 할 수 없는 공간
 */


